================================================================================
VALID - Declaration meta
================================================================================

meta NotTranspile;
meta Metadata();
meta Metadata(string);
meta Metadata(name: string, name2: string);

--------------------------------------------------------------------------------

(source_file
  (metadata_declaration
    (identifier))
  (metadata_declaration
    (identifier))
  (metadata_declaration
    (identifier)
    (type_expression
      (type_identifier
        (primitive_keyword))))
  (metadata_declaration
    (identifier)
    (parameter_declaration
      (identifier)
      (type_expression
        (type_identifier
          (primitive_keyword))))
    (parameter_declaration
      (identifier)
      (type_expression
        (type_identifier
          (primitive_keyword))))))

================================================================================
VALID - Use meta
================================================================================

#[NotTranspile, Metadata, Metadata("test"), Metadata("test", "test")]
function test(): void {}

--------------------------------------------------------------------------------

(source_file
  (expression
    (metadata_expression
      (identifier)
      (identifier)
      (identifier)
      (expression
        (primary_expression
          (literal
            (string_literal))))
      (identifier)
      (expression
        (primary_expression
          (literal
            (string_literal))))
      (expression
        (primary_expression
          (literal
            (string_literal))))))
  (function_declaration
    (identifier)
    (type_expression
      (type_identifier
        (primitive_keyword)))
    (block)))

================================================================================
VALID - Use meta in param
================================================================================

function test(#[Metadata("test", "test")] test: string): void {}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (parameter_declaration
      (metadata_expression
        (identifier)
        (expression
          (primary_expression
            (literal
              (string_literal))))
        (expression
          (primary_expression
            (literal
              (string_literal)))))
      (identifier)
      (type_expression
        (type_identifier
          (primitive_keyword))))
    (type_expression
      (type_identifier
        (primitive_keyword)))
    (block)))

================================================================================
VALID - Use meta in record
================================================================================

#[Metadata]
record Test {
  #[Metadata]
  test: string;
  #[Metadata]
  test2(): string;
}

--------------------------------------------------------------------------------

(source_file
  (expression
    (metadata_expression
      (identifier)))
  (record_declaration
    (type_expression
      (type_identifier
        (identifier)))
    (metadata_expression
      (identifier))
    (record_property_declaration
      (identifier)
      (type_expression
        (type_identifier
          (primitive_keyword))))
    (metadata_expression
      (identifier))
    (record_method_declaration
      (identifier)
      (type_expression
        (type_identifier
          (primitive_keyword))))))
